In [2]:
import pandas as pd
import numpy as np
import locale

locale.setlocale(locale.LC_ALL, 'English_United States.1252')

'English_United States.1252'

In [399]:
file_school_data = "Resources/schools_complete.csv"
file_student_data = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(file_school_data)
student_data = pd.read_csv(file_student_data)

# Combine the data into a single dataset
#combined_df = pd.merge(student_data, school_data, how="left", on="school_name")
combined_df = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [381]:
district_summary = pd.DataFrame({"Total Schools":[combined_df['School ID'].nunique()],
    "Total Students":["{:,}".format(combined_df["Student ID"].nunique())],
    "Total Budget":["${0:,.2f}".format(school_data["budget"].sum())],
    "Average Math Score":["{0:.2f}".format(combined_df["math_score"].mean())],
    "Average Reading Score":["{0:.2f}".format(combined_df["reading_score"].mean())],
    "% Passing Math":["{0:.2%}".format(combined_df[combined_df["math_score"] > 70]["Student ID"].nunique()/combined_df["Student ID"].nunique())],
    "% Passing Reading":["{0:.2%}".format(combined_df[combined_df["reading_score"] > 70]["Student ID"].nunique()/combined_df["Student ID"].nunique())
],
    "% Overall Passing Rate":["{0:.2%}".format(combined_df[(combined_df["math_score"] > 70) & (combined_df["reading_score"] > 70)]["Student ID"].nunique()/combined_df["Student ID"].nunique())]})


district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.99,81.88,72.39%,82.97%,60.80%

In [418]:
school_summary = pd.DataFrame({"School Name":combined_df["school_name"].unique(),
        "School Type":school_data[["school_name","type"]]["type"],
        "Total Students":school_data[["school_name","size"]]["size"],
        "Per Student Budget":school_data["budget"]/school_data["size"],
        "Average Math Score":combined_df.groupby("school_name").mean()["math_score"].values,
        "Average Reading Score":combined_df.groupby("school_name").mean()["reading_score"].values,
                               
        "Overall Passing Rate":(combined_df.groupby("school_name").mean()["math_score"].values + \
                                combined_df.groupby("school_name").mean()["reading_score"].values)/2
})

school_summary["Total Students"] = school_summary["Total Students"].map("{:,}".format)
school_summary["Per Student Budget"] = school_summary["Per Student Budget"].map("${:,.2f}".format)
school_summary["Average Math Score"] = school_summary["Average Math Score"].map("{:.2f}".format)
school_summary["Average Reading Score"] = school_summary["Average Reading Score"].map("{:.2f}".format)
school_summary["Overall Passing Rate"] = school_summary["Overall Passing Rate"].map("{:.2f}".format)
school_summary


   
# combined_df.groupby("school_name").sum()["math_score"]/combined_df.groupby("school_name")["Student ID"].count()


# combined_df[combined_df["reading_score"] > 70][["school_name","reading_score"]].groupby("school_name").count()/combined_df.groupby("school_name")["Student ID"].count().values
# school_data["budget"]/school_data["size"]


passing_reading = combined_df[combined_df["reading_score"] > 70][["school_name","reading_score"]].groupby("school_name").count()
passing_math = combined_df[combined_df["math_score"] > 70][["school_name","math_score"]].groupby("school_name").count()


#combined_df[combined_df["reading_score"] > 70][["school_name","reading_score"]].groupby("school_name").sum()

# passing_math = 
# scores_by_school = pd.merge(passing_reading, school_data,  on = 'school_name')
# scores_by_school
# # students_by_school["% Passing Reading"]=students_by_school["reading_score"]/students_by_school["size"]
# students_by_school

In [390]:
#"School Name":
combined_df["school_name"].unique()

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [393]:
school_data[["school_name","type"]]["type"]

0     District
1     District
2      Charter
3     District
4      Charter
5      Charter
6      Charter
7     District
8      Charter
9      Charter
10     Charter
11    District
12    District
13    District
14     Charter
Name: type, dtype: object

In [217]:
school_summary.set_index("School Name").sort_values("Overall Passing Rate", ascending=False).head()

,School Type,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,,
Pena High School,Charter,962,$609.00,83.84,84.04,83.942308
Thomas High School,Charter,"1,635",$638.00,83.68,83.95,83.818611
Cabrera High School,Charter,"1,858",$582.00,83.80,83.81,83.809133
Johnson High School,District,"4,761",$650.00,83.42,83.85,83.633639
Ford High School,District,"2,739",$644.00,83.27,83.99,83.631844

In [218]:
school_summary.set_index("School Name").sort_values("Overall Passing Rate").head()

,School Type,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Overall Passing Rate
School Name,,,,,,
Wright High School,Charter,"1,800",$583.00,76.84,80.74,78.793698
Bailey High School,District,"4,976",$628.00,76.63,81.18,78.906068
Hernandez High School,District,"4,635",$652.00,77.10,80.75,78.924425
Shelton High School,Charter,"1,761",$600.00,76.71,81.16,78.934893
Holden High School,Charter,427,$581.00,77.07,80.97,79.019429

In [219]:
combined_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [220]:
ninth_grade = combined_df[combined_df.grade == '9th'][["school_name","math_score"]].set_index("school_name").groupby("school_name").mean()
ninth_grade.columns = ['9th']

tenth_grade = combined_df[combined_df.grade == '10th'][["school_name","math_score"]].set_index("school_name").groupby("school_name").mean()
tenth_grade.columns = ['10th']

eleventh_grade = combined_df[combined_df.grade == '11th'][["school_name","math_score"]].set_index("school_name").groupby("school_name").mean()
eleventh_grade.columns = ['11th']

twelfth_grade = combined_df[combined_df.grade == '12th'][["school_name","math_score"]].set_index("school_name").groupby("school_name").mean()
twelfth_grade.columns = ["12th"]
# twelfth_grade.columns

combinded_grades = pd.merge(ninth_grade, tenth_grade, on="school_name")
combinded_grades = pd.merge(combinded_grades, eleventh_grade, on="school_name")
combinded_grades = pd.merge(combinded_grades, twelfth_grade, on="school_name")
combinded_grades.index.names = ['School Name']

combinded_grades["9th"] = combinded_grades["9th"].map("{:.2f}".format)
combinded_grades["10th"] = combinded_grades["10th"].map("{:.2f}".format)
combinded_grades["11th"] = combinded_grades["11th"].map("{:.2f}".format)
combinded_grades["12th"] = combinded_grades["12th"].map("{:.2f}".format)

combinded_grades.index.names = ['School Name']

combinded_grades

                         9th   10th   11th   12th
School Name
Bailey High School     77.08  77.00  77.52  76.49
Cabrera High School    83.09  83.15  82.77  83.28
Figueroa High School   76.40  76.54  76.88  77.15
Ford High School       77.36  77.67  76.92  76.18
Griffin High School    82.04  84.23  83.84  83.36
Hernandez High School  77.44  77.34  77.14  77.19
Holden High School     83.79  83.43  85.00  82.86
Huang High School      77.03  75.91  76.45  77.23
Johnson High School    77.19  76.69  77.49  76.86
Pena High School       83.63  83.37  84.33  84.12
Rodriguez High School  76.86  76.61  76.40  77.69
Shelton High School    83.42  82.92  83.38  83.78
Thomas High School     83.59  83.09  83.50  83.50
Wilson High School     83.09  83.72  83.20  83.04
Wright High School     83.26  84.01  83.84  83.64

In [224]:
ninth_grade = combined_df[combined_df.grade == '9th'][["school_name","reading_score"]].set_index("school_name").groupby("school_name").mean()
ninth_grade.columns = ['9th']

tenth_grade = combined_df[combined_df.grade == '10th'][["school_name","reading_score"]].set_index("school_name").groupby("school_name").mean()
tenth_grade.columns = ['10th']

eleventh_grade = combined_df[combined_df.grade == '11th'][["school_name","reading_score"]].set_index("school_name").groupby("school_name").mean()
eleventh_grade.columns = ['11th']

twelfth_grade = combined_df[combined_df.grade == '12th'][["school_name","reading_score"]].set_index("school_name").groupby("school_name").mean()
twelfth_grade.columns = ["12th"]
# twelfth_grade.columns

combinded_grades = pd.merge(ninth_grade, tenth_grade, on="school_name")
combinded_grades = pd.merge(combinded_grades, eleventh_grade, on="school_name")
combinded_grades = pd.merge(combinded_grades, twelfth_grade, on="school_name")
combinded_grades.index.names = ['School Name']

combinded_grades["9th"] = combinded_grades["9th"].map("{:.2f}".format)
combinded_grades["10th"] = combinded_grades["10th"].map("{:.2f}".format)
combinded_grades["11th"] = combinded_grades["11th"].map("{:.2f}".format)
combinded_grades["12th"] = combinded_grades["12th"].map("{:.2f}".format)

combinded_grades.index.names = ['School Name']

combinded_grades

                         9th   10th   11th   12th
School Name
Bailey High School     81.30  80.91  80.95  80.91
Cabrera High School    83.68  84.25  83.79  84.29
Figueroa High School   81.20  81.41  80.64  81.38
Ford High School       80.63  81.26  80.40  80.66
Griffin High School    83.37  83.71  84.29  84.01
Hernandez High School  80.87  80.66  81.40  80.86
Holden High School     83.68  83.32  83.82  84.70
Huang High School      81.29  81.51  81.42  80.31
Johnson High School    81.26  80.77  80.62  81.23
Pena High School       83.81  83.61  84.34  84.59
Rodriguez High School  80.99  80.63  80.86  80.38
Shelton High School    84.12  83.44  84.37  82.78
Thomas High School     83.73  84.25  83.59  83.83
Wilson High School     83.94  84.02  83.76  84.32
Wright High School     83.83  83.81  84.16  84.07